test/fixtures/xml/fedex/freight_rate_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<v13:RateReply xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <v13:HighestSeverity>SUCCESS</v13:HighestSeverity>
  <v13:Notifications>
    <v13:Severity>SUCCESS</v13:Severity>
    <v13:Source>crs</v13:Source>
    <v13:Code>0</v13:Code>
    <v13:Message>Request was successfully processed. </v13:Message>
    <v13:LocalizedMessage>Request was successfully processed. </v13:LocalizedMessage>
  </v13:Notifications>
  <v13:TransactionDetail>
    <v13:CustomerTransactionId>ActiveShipping</v13:CustomerTransactionId>
  </v13:TransactionDetail>
  <v13:Version>
    <v13:ServiceId>crs</v13:ServiceId>
    <v13:Major>13</v13:Major>
    <v13:Intermediate>0</v13:Intermediate>
    <v13:Minor>0</v13:Minor>
  </v13:Version>
  <v13:RateReplyDetails>
    <v13:ServiceType>FEDEX_FREIGHT_ECONOMY</v13:ServiceType>
    <v13:DeliveryDayOfWeek>THU</v13:DeliveryDayOfWeek>
    <v13:DeliveryTimestamp>2013-11-07T17:00:00-04:00</v13:DeliveryTimestamp>
    <v13:CommitDetails>
      <v13:ServiceType>FEDEX_FREIGHT_ECONOMY</v13:ServiceType>
      <v13:CommitTimestamp>2013-11-07T17:00:00-04:00</v13:CommitTimestamp>
      <v13:DayOfWeek>THU</v13:DayOfWeek>
      <v13:TransitTime>FOUR_DAYS</v13:TransitTime>
      <v13:BrokerToDestinationDays>0</v13:BrokerToDestinationDays>
      <v13:FreightCommitDetail>
        <v13:OriginDetail>
          <v13:AdditionalDays>0</v13:AdditionalDays>
          <v13:LocalService>FEDEX_FREIGHT_ECONOMY</v13:LocalService>
          <v13:LocalDistance>
            <v13:Value>2.0</v13:Value>
            <v13:Units>MI</v13:Units>
          </v13:LocalDistance>
          <v13:LocalDuration>P0DT00H03M</v13:LocalDuration>
          <v13:LocalServiceScheduling>STANDARD</v13:LocalServiceScheduling>
          <v13:Location>HRO</v13:Location>
          <v13:ContactAndAddress>
            <v13:Contact>
              <v13:PersonName>FRED GARRY</v13:PersonName>
              <v13:PhoneNumber>800-874-4723</v13:PhoneNumber>
              <v13:FaxNumber>870-741-7325</v13:FaxNumber>
            </v13:Contact>
            <v13:Address>
              <v13:StreetLines>2200 FORWARD DR</v13:StreetLines>
              <v13:City>HARRISON</v13:City>
              <v13:StateOrProvinceCode>AR</v13:StateOrProvinceCode>
              <v13:PostalCode>72601-2004</v13:PostalCode>
              <v13:CountryCode>US</v13:CountryCode>
              <v13:Residential>false</v13:Residential>
            </v13:Address>
          </v13:ContactAndAddress>
        </v13:OriginDetail>
        <v13:DestinationDetail>
          <v13:AdditionalDays>0</v13:AdditionalDays>
          <v13:LocalService>FEDEX_FREIGHT_ECONOMY</v13:LocalService>
          <v13:LocalDistance>
            <v13:Value>0.0</v13:Value>
            <v13:Units>MI</v13:Units>
          </v13:LocalDistance>
          <v13:LocalServiceScheduling>STANDARD</v13:LocalServiceScheduling>
          <v13:GatewayLocationId>NTO</v13:GatewayLocationId>
          <v13:Location>OTW</v13:Location>
          <v13:ContactAndAddress>
            <v13:Contact>
              <v13:PersonName>CHRIS LACHANCE</v13:PersonName>
              <v13:PhoneNumber>888-219-6413</v13:PhoneNumber>
              <v13:FaxNumber>613-745-8004</v13:FaxNumber>
            </v13:Contact>
            <v13:Address>
              <v13:StreetLines>1740 COMSTOCK ROAD</v13:StreetLines>
              <v13:City>GLOUCESTER</v13:City>
              <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
              <v13:PostalCode>K1B5L2</v13:PostalCode>
              <v13:CountryCode>CA</v13:CountryCode>
              <v13:Residential>false</v13:Residential>
            </v13:Address>
          </v13:ContactAndAddress>
        </v13:DestinationDetail>
        <v13:TotalDistance>
          <v13:Value>1635.0</v13:Value>
          <v13:Units>MI</v13:Units>
        </v13:TotalDistance>
      </v13:FreightCommitDetail>
    </v13:CommitDetails>
    <v13:IneligibleForMoneyBackGuarantee>true</v13:IneligibleForMoneyBackGuarantee>
    <v13:TransitTime>FOUR_DAYS</v13:TransitTime>
    <v13:ActualRateType>PAYOR_ACCOUNT_SHIPMENT</v13:ActualRateType>
    <v13:RatedShipmentDetails>
      <v13:ShipmentRateDetail>
        <v13:RateType>PAYOR_ACCOUNT_SHIPMENT</v13:RateType>
        <v13:RateScale>*FXF 501 CN 07/01 13     LD 06122</v13:RateScale>
        <v13:RatedWeightMethod>FREIGHT_MINIMUM</v13:RatedWeightMethod>
        <v13:CurrencyExchangeRate>
          <v13:FromCurrency>USD</v13:FromCurrency>
          <v13:IntoCurrency>CAD</v13:IntoCurrency>
          <v13:Rate>1.07</v13:Rate>
        </v13:CurrencyExchangeRate>
        <v13:DimDivisor>0</v13:DimDivisor>
        <v13:FuelSurchargePercent>23.1</v13:FuelSurchargePercent>
        <v13:TotalBillingWeight>
          <v13:Units>LB</v13:Units>
          <v13:Value>7.5</v13:Value>
        </v13:TotalBillingWeight>
        <v13:TotalDimWeight>
          <v13:Units>LB</v13:Units>
          <v13:Value>0.0</v13:Value>
        </v13:TotalDimWeight>
        <v13:TotalBaseCharge>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>578.8</v13:Amount>
        </v13:TotalBaseCharge>
        <v13:TotalFreightDiscounts>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>231.52</v13:Amount>
        </v13:TotalFreightDiscounts>
        <v13:TotalNetFreight>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>347.28</v13:Amount>
        </v13:TotalNetFreight>
        <v13:TotalSurcharges>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>315.35</v13:Amount>
        </v13:TotalSurcharges>
        <v13:TotalNetFedExCharge>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>662.63</v13:Amount>
        </v13:TotalNetFedExCharge>
        <v13:TotalTaxes>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>0.0</v13:Amount>
        </v13:TotalTaxes>
        <v13:TotalNetCharge>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>662.63</v13:Amount>
        </v13:TotalNetCharge>
        <v13:ShipmentLegRateDetails>
          <v13:LegDescription>TO BORDER</v13:LegDescription>
          <v13:LegOrigin>
            <v13:City>HARRISON</v13:City>
            <v13:StateOrProvinceCode>AR</v13:StateOrProvinceCode>
            <v13:PostalCode>72601</v13:PostalCode>
            <v13:CountryCode>US</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegOrigin>
          <v13:LegDestination>
            <v13:City>TOLEDO</v13:City>
            <v13:StateOrProvinceCode>OH</v13:StateOrProvinceCode>
            <v13:PostalCode>43612</v13:PostalCode>
            <v13:CountryCode>US</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegDestination>
          <v13:LegDestinationLocationId>NTO</v13:LegDestinationLocationId>
          <v13:DimDivisor>0</v13:DimDivisor>
          <v13:FuelSurchargePercent>0.0</v13:FuelSurchargePercent>
          <v13:FreightRateDetail>
            <v13:QuoteType>AUTOMATED</v13:QuoteType>
            <v13:BaseChargeCalculation>LINE_ITEMS</v13:BaseChargeCalculation>
          </v13:FreightRateDetail>
        </v13:ShipmentLegRateDetails>
        <v13:ShipmentLegRateDetails>
          <v13:LegDescription>FROM BORDER</v13:LegDescription>
          <v13:LegOrigin>
            <v13:City>TOLEDO</v13:City>
            <v13:StateOrProvinceCode>OH</v13:StateOrProvinceCode>
            <v13:PostalCode>43612</v13:PostalCode>
            <v13:CountryCode>US</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegOrigin>
          <v13:LegOriginLocationId>NTO</v13:LegOriginLocationId>
          <v13:LegDestination>
            <v13:City>OTTAWA</v13:City>
            <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
            <v13:PostalCode>K1P1J1</v13:PostalCode>
            <v13:CountryCode>CA</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegDestination>
          <v13:DimDivisor>0</v13:DimDivisor>
          <v13:FuelSurchargePercent>0.0</v13:FuelSurchargePercent>
          <v13:FreightRateDetail>
            <v13:QuoteType>AUTOMATED</v13:QuoteType>
            <v13:BaseChargeCalculation>LINE_ITEMS</v13:BaseChargeCalculation>
          </v13:FreightRateDetail>
        </v13:ShipmentLegRateDetails>
        <v13:FreightRateDetail>
          <v13:QuoteNumber>1144657647</v13:QuoteNumber>
          <v13:QuoteType>AUTOMATED</v13:QuoteType>
          <v13:BaseChargeCalculation>LINE_ITEMS</v13:BaseChargeCalculation>
          <v13:BaseCharges>
            <v13:FreightClass>CLASS_050</v13:FreightClass>
            <v13:RatedAsClass>CLASS_050</v13:RatedAsClass>
            <v13:Description>NO DESCRIPTION</v13:Description>
            <v13:Weight>
              <v13:Units>LB</v13:Units>
              <v13:Value>7.5</v13:Value>
            </v13:Weight>
            <v13:ChargeRate>
              <v13:Currency>USD</v13:Currency>
              <v13:Amount>0.0</v13:Amount>
            </v13:ChargeRate>
            <v13:ChargeBasis>MINIMUM</v13:ChargeBasis>
            <v13:ExtendedAmount>
              <v13:Currency>USD</v13:Currency>
              <v13:Amount>578.8</v13:Amount>
            </v13:ExtendedAmount>
          </v13:BaseCharges>
          <v13:Notations>
            <v13:Code>DISCOUNT_TARIFF</v13:Code>
            <v13:Description>DISCOUNT FXF    9000 0041391.0802</v13:Description>
          </v13:Notations>
        </v13:FreightRateDetail>
        <v13:FreightDiscounts>
          <v13:RateDiscountType>OTHER</v13:RateDiscountType>
          <v13:Description>less 40% discount</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>231.52</v13:Amount>
          </v13:Amount>
          <v13:Percent>40.0</v13:Percent>
        </v13:FreightDiscounts>
        <v13:Surcharges>
          <v13:SurchargeType>RESIDENTIAL_PICKUP</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>RESIDENTIAL_PICKUP</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>108.68</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
        <v13:Surcharges>
          <v13:SurchargeType>RESIDENTIAL_DELIVERY</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>RESIDENTIAL_DELIVERY</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>108.68</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
        <v13:Surcharges>
          <v13:SurchargeType>OTHER</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>BORDER_CROSSING_FEE</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>17.77</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
        <v13:Surcharges>
          <v13:SurchargeType>FUEL</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>FUEL</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>80.22</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
      </v13:ShipmentRateDetail>
    </v13:RatedShipmentDetails>
  </v13:RateReplyDetails>
  <v13:RateReplyDetails>
    <v13:ServiceType>FEDEX_FREIGHT_PRIORITY</v13:ServiceType>
    <v13:DeliveryDayOfWeek>WED</v13:DeliveryDayOfWeek>
    <v13:DeliveryTimestamp>2013-11-06T17:00:00-04:00</v13:DeliveryTimestamp>
    <v13:CommitDetails>
      <v13:ServiceType>FEDEX_FREIGHT_PRIORITY</v13:ServiceType>
      <v13:CommitTimestamp>2013-11-06T17:00:00-04:00</v13:CommitTimestamp>
      <v13:DayOfWeek>WED</v13:DayOfWeek>
      <v13:TransitTime>THREE_DAYS</v13:TransitTime>
      <v13:BrokerToDestinationDays>0</v13:BrokerToDestinationDays>
      <v13:FreightCommitDetail>
        <v13:OriginDetail>
          <v13:AdditionalDays>0</v13:AdditionalDays>
          <v13:LocalService>FEDEX_FREIGHT_PRIORITY</v13:LocalService>
          <v13:LocalDistance>
            <v13:Value>2.0</v13:Value>
            <v13:Units>MI</v13:Units>
          </v13:LocalDistance>
          <v13:LocalDuration>P0DT00H03M</v13:LocalDuration>
          <v13:LocalServiceScheduling>STANDARD</v13:LocalServiceScheduling>
          <v13:Location>HRO</v13:Location>
          <v13:ContactAndAddress>
            <v13:Contact>
              <v13:PersonName>FRED GARRY</v13:PersonName>
              <v13:PhoneNumber>800-874-4723</v13:PhoneNumber>
              <v13:FaxNumber>870-741-7325</v13:FaxNumber>
            </v13:Contact>
            <v13:Address>
              <v13:StreetLines>2200 FORWARD DR</v13:StreetLines>
              <v13:City>HARRISON</v13:City>
              <v13:StateOrProvinceCode>AR</v13:StateOrProvinceCode>
              <v13:PostalCode>72601-2004</v13:PostalCode>
              <v13:CountryCode>US</v13:CountryCode>
              <v13:Residential>false</v13:Residential>
            </v13:Address>
          </v13:ContactAndAddress>
        </v13:OriginDetail>
        <v13:DestinationDetail>
          <v13:AdditionalDays>0</v13:AdditionalDays>
          <v13:LocalService>FEDEX_FREIGHT_PRIORITY</v13:LocalService>
          <v13:LocalDistance>
            <v13:Value>0.0</v13:Value>
            <v13:Units>MI</v13:Units>
          </v13:LocalDistance>
          <v13:LocalServiceScheduling>STANDARD</v13:LocalServiceScheduling>
          <v13:GatewayLocationId>NTO</v13:GatewayLocationId>
          <v13:Location>OTW</v13:Location>
          <v13:ContactAndAddress>
            <v13:Contact>
              <v13:PersonName>CHRIS LACHANCE</v13:PersonName>
              <v13:PhoneNumber>888-219-6413</v13:PhoneNumber>
              <v13:FaxNumber>613-745-8004</v13:FaxNumber>
            </v13:Contact>
            <v13:Address>
              <v13:StreetLines>1740 COMSTOCK ROAD</v13:StreetLines>
              <v13:City>GLOUCESTER</v13:City>
              <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
              <v13:PostalCode>K1B5L2</v13:PostalCode>
              <v13:CountryCode>CA</v13:CountryCode>
              <v13:Residential>false</v13:Residential>
            </v13:Address>
          </v13:ContactAndAddress>
        </v13:DestinationDetail>
        <v13:TotalDistance>
          <v13:Value>1393.0</v13:Value>
          <v13:Units>MI</v13:Units>
        </v13:TotalDistance>
      </v13:FreightCommitDetail>
    </v13:CommitDetails>
    <v13:IneligibleForMoneyBackGuarantee>true</v13:IneligibleForMoneyBackGuarantee>
    <v13:TransitTime>THREE_DAYS</v13:TransitTime>
    <v13:ActualRateType>PAYOR_ACCOUNT_SHIPMENT</v13:ActualRateType>
    <v13:RatedShipmentDetails>
      <v13:ShipmentRateDetail>
        <v13:RateType>PAYOR_ACCOUNT_SHIPMENT</v13:RateType>
        <v13:RateScale>*FXF 1000 CN 07/01 13     LD 06122</v13:RateScale>
        <v13:RatedWeightMethod>FREIGHT_MINIMUM</v13:RatedWeightMethod>
        <v13:CurrencyExchangeRate>
          <v13:FromCurrency>USD</v13:FromCurrency>
          <v13:IntoCurrency>CAD</v13:IntoCurrency>
          <v13:Rate>1.07</v13:Rate>
        </v13:CurrencyExchangeRate>
        <v13:DimDivisor>0</v13:DimDivisor>
        <v13:FuelSurchargePercent>23.1</v13:FuelSurchargePercent>
        <v13:TotalBillingWeight>
          <v13:Units>LB</v13:Units>
          <v13:Value>7.5</v13:Value>
        </v13:TotalBillingWeight>
        <v13:TotalDimWeight>
          <v13:Units>LB</v13:Units>
          <v13:Value>0.0</v13:Value>
        </v13:TotalDimWeight>
        <v13:TotalBaseCharge>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>609.27</v13:Amount>
        </v13:TotalBaseCharge>
        <v13:TotalFreightDiscounts>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>243.71</v13:Amount>
        </v13:TotalFreightDiscounts>
        <v13:TotalNetFreight>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>365.56</v13:Amount>
        </v13:TotalNetFreight>
        <v13:TotalSurcharges>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>319.57</v13:Amount>
        </v13:TotalSurcharges>
        <v13:TotalNetFedExCharge>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>685.13</v13:Amount>
        </v13:TotalNetFedExCharge>
        <v13:TotalTaxes>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>0.0</v13:Amount>
        </v13:TotalTaxes>
        <v13:TotalNetCharge>
          <v13:Currency>USD</v13:Currency>
          <v13:Amount>685.13</v13:Amount>
        </v13:TotalNetCharge>
        <v13:ShipmentLegRateDetails>
          <v13:LegDescription>TO BORDER</v13:LegDescription>
          <v13:LegOrigin>
            <v13:City>HARRISON</v13:City>
            <v13:StateOrProvinceCode>AR</v13:StateOrProvinceCode>
            <v13:PostalCode>72601</v13:PostalCode>
            <v13:CountryCode>US</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegOrigin>
          <v13:LegDestination>
            <v13:City>TOLEDO</v13:City>
            <v13:StateOrProvinceCode>OH</v13:StateOrProvinceCode>
            <v13:PostalCode>43612</v13:PostalCode>
            <v13:CountryCode>US</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegDestination>
          <v13:LegDestinationLocationId>NTO</v13:LegDestinationLocationId>
          <v13:DimDivisor>0</v13:DimDivisor>
          <v13:FuelSurchargePercent>0.0</v13:FuelSurchargePercent>
          <v13:FreightRateDetail>
            <v13:QuoteType>AUTOMATED</v13:QuoteType>
            <v13:BaseChargeCalculation>LINE_ITEMS</v13:BaseChargeCalculation>
          </v13:FreightRateDetail>
        </v13:ShipmentLegRateDetails>
        <v13:ShipmentLegRateDetails>
          <v13:LegDescription>FROM BORDER</v13:LegDescription>
          <v13:LegOrigin>
            <v13:City>TOLEDO</v13:City>
            <v13:StateOrProvinceCode>OH</v13:StateOrProvinceCode>
            <v13:PostalCode>43612</v13:PostalCode>
            <v13:CountryCode>US</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegOrigin>
          <v13:LegOriginLocationId>NTO</v13:LegOriginLocationId>
          <v13:LegDestination>
            <v13:City>OTTAWA</v13:City>
            <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
            <v13:PostalCode>K1P1J1</v13:PostalCode>
            <v13:CountryCode>CA</v13:CountryCode>
            <v13:Residential>false</v13:Residential>
          </v13:LegDestination>
          <v13:DimDivisor>0</v13:DimDivisor>
          <v13:FuelSurchargePercent>0.0</v13:FuelSurchargePercent>
          <v13:FreightRateDetail>
            <v13:QuoteType>AUTOMATED</v13:QuoteType>
            <v13:BaseChargeCalculation>LINE_ITEMS</v13:BaseChargeCalculation>
          </v13:FreightRateDetail>
        </v13:ShipmentLegRateDetails>
        <v13:FreightRateDetail>
          <v13:QuoteNumber>1144657648</v13:QuoteNumber>
          <v13:QuoteType>AUTOMATED</v13:QuoteType>
          <v13:BaseChargeCalculation>LINE_ITEMS</v13:BaseChargeCalculation>
          <v13:BaseCharges>
            <v13:FreightClass>CLASS_050</v13:FreightClass>
            <v13:RatedAsClass>CLASS_050</v13:RatedAsClass>
            <v13:Description>NO DESCRIPTION</v13:Description>
            <v13:Weight>
              <v13:Units>LB</v13:Units>
              <v13:Value>7.5</v13:Value>
            </v13:Weight>
            <v13:ChargeRate>
              <v13:Currency>USD</v13:Currency>
              <v13:Amount>0.0</v13:Amount>
            </v13:ChargeRate>
            <v13:ChargeBasis>MINIMUM</v13:ChargeBasis>
            <v13:ExtendedAmount>
              <v13:Currency>USD</v13:Currency>
              <v13:Amount>609.27</v13:Amount>
            </v13:ExtendedAmount>
          </v13:BaseCharges>
          <v13:Notations>
            <v13:Code>DISCOUNT_TARIFF</v13:Code>
            <v13:Description>DISCOUNT FXF    9000 0041391.0102</v13:Description>
          </v13:Notations>
        </v13:FreightRateDetail>
        <v13:FreightDiscounts>
          <v13:RateDiscountType>OTHER</v13:RateDiscountType>
          <v13:Description>less 40% discount</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>243.71</v13:Amount>
          </v13:Amount>
          <v13:Percent>40.0</v13:Percent>
        </v13:FreightDiscounts>
        <v13:Surcharges>
          <v13:SurchargeType>RESIDENTIAL_PICKUP</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>RESIDENTIAL_PICKUP</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>108.68</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
        <v13:Surcharges>
          <v13:SurchargeType>RESIDENTIAL_DELIVERY</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>RESIDENTIAL_DELIVERY</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>108.68</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
        <v13:Surcharges>
          <v13:SurchargeType>OTHER</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>BORDER_CROSSING_FEE</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>17.77</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
        <v13:Surcharges>
          <v13:SurchargeType>FUEL</v13:SurchargeType>
          <v13:Level>SHIPMENT</v13:Level>
          <v13:Description>FUEL</v13:Description>
          <v13:Amount>
            <v13:Currency>USD</v13:Currency>
            <v13:Amount>84.44</v13:Amount>
          </v13:Amount>
        </v13:Surcharges>
      </v13:ShipmentRateDetail>
    </v13:RatedShipmentDetails>
  </v13:RateReplyDetails>
</v13:RateReply>